[{
        "company": "Portfolio Recovery Associates",
        "jobtitle": "Senior Software Engineer",
        "text": "",
        "logo": "pra.png",
        "dates": {
            "startYear": "2017",
            "endYear": "2019"
        },
        "achievements": [
            { "text": "Lead corporate redesign of prapay.com utilizing Bootstrap 4, SASS, jQuery, JSON, and Knockout JS on .NET MVC 5 C#." },
            { "text": "Lead redesign of payment process user experience for the United Kingdom prapay.com web application.  Utilized jQuery, AJAX, JSON, C#, MVC connecting to our internal API’s for functionality and SASS/Bootstrap 4 for UI and animations." },
            { "text": "Lead front end initiative to modularize JavaScript files, and teach / implement separation of concerns and D.R.Y methodologies to junior developers." },
            { "text": "Lead User Experience and User Design initiatives for new features with Balsamic for wireframing during concept phase, Bootstrap 4 with SASS and jQuery for rapid prototyping and final builds." },
            { "text": "Standardized developer guidelines for front end coding." },
            { "text": "Implemented daily team code reviews allowing team to present completed code for review or partial for guidance and collaberation." }
        ]
    },
    {
        "company": "True Health Diagnostics",
        "agency": ["Atlantic Resource Group"],
        "jobtitle": "Lead UX Developer",
        "text": "",
        "logo": "truehealth.png",
        "dates": {
            "startYear": "2014",
            "endYear": "2017"
        },
        "achievements": [
            { "text": "Lead front end application development utilizing Bootstrap 3, Google Material Design Lite, AngularJS, LESS, JavaScript, jQuery, AJAX, JSON, and Thymeleaf for applications built with Java." },
            { "text": "Lead integration of responsive designs with single page and MVC applications." },
            { "text": "Lead push for content delivery network to serve brand files for CSS and JavaScript for all internal applications." },
            { "text": "Lead direction for Restful API services to deliver content to front end." },
            { "text": "Lead wire framing mock ups for new applications." },
            { "text": "Lead front end initiative to modularize JavaScript files, implement separation of concerns and D.R.Y methodologies." }
        ]
    },
    {
        "company": "Health Diagnostic Laboratory",
        "jobtitle": "Senior Web Developer",
        "text": "",
        "logo": "hdl.png",
        "dates": {
            "startYear": "2014",
            "endYear": "2015"
        },
        "achievements": [
            { "text": "Worked with leadership to design and develop web sites to expand the business and brand." },
            { "text": "Developed and enhanced internal applications to increase user productivity through usability." },
            { "text": "Sole Front End resource for all development utilizing HTML 5, CSS 3, Bootstrap 3, JavaScript, JQUERY and Grails." }
        ]
    },
    {
        "company": "GE Healthcare",
        "jobtitle": "Software Engineer",
        "text": "",
        "logo": "gehealthcare.png",
        "dates": {
            "startYear": "2013",
            "endYear": "2014"
        },
        "achievements": [
            { "text": "Member of the Global Asset Management team, representing the face of high quality design and development practices." },
            { "text": "Partnered with the Software Center of Excellence architecture and engineering teams to implement UI solutions that are aligned and extend shared platforms and solutions." },
            { "text": "Extensive JavaScript, JQUERY, and Angular JS development." }
        ]
    },
    {
        "company": "Harland Clarke",
        "agency": ["Randstad"],
        "jobtitle": "UI/UX Designer / Developer",
        "text": "",
        "logo": "harlandclarke.png",
        "dates": {
            "startYear": "2012",
            "endYear": "2013"
        },
        "achievements": [
            { "text": "Worked closely with Senior Leadership, Management, Designers, and Developers to lead the UI/UX development of a custom 960 responsive grid system to meet their requirements for web, mobile, ASP.net and J2EE integration for their multiple ecommerce based websites including walmart.stationery.com, iprint.com, and officedepot.com." },
            { "text": "Supporting the developers' efforts to integrate resulting product with back end development." }
        ]
    },
    {
        "company": "Capital One",
        "agency": ["Celerity"],
        "jobtitle": "UI/UX Designer / Developer",
        "text": "",
        "logo": "capitalone.png",
        "dates": {
            "startYear": "2010",
            "endYear": "2012"
        },
        "achievements": [
            { "text": "Various tasks and duties pertaining to ecommerce for Capital One." },
            { "text": "Lead UI/UX design and development for multiple projects while supporting multiple teams including SSP, BAU, Servicing, EOS, and the Flex Design team." },
            { "text": "Developed and managed SSP build book." }
        ]
    },
    {
        "company": "Circuit City",
        "jobtitle": "Programmer Analyst",
        "text": "",
        "logo": "circuitcity.png",
        "dates": {
            "startYear": "2008",
            "endYear": "2010"
        },
        "achievements": [
            { "text": "Worked closely with Project Managers, Business Managers, external and internal Business Units to design, develop, and maintain firedog.com." },
            { "text": "Lead design and development for firedog.com." }
        ]
    },
    {
        "company": "Global Web Solutions",
        "jobtitle": "Web Developer / Designer",
        "text": "",
        "logo": "globalwebsolutions.png",
        "dates": {
            "startYear": "2001",
            "endYear": "2004"
        },
        "achievements": [
            { "text": "Work closely with Business Owners, Managers, and Employees to design, develop, and maintain ecommerce and informational sites for small to medium sized businesses." }

        ]
    },
    {
        "company": "First Union National Bank",
        "jobtitle": "Web Developer / Officer",
        "text": "",
        "logo": "firstunion.png",
        "dates": {
            "startYear": "1996",
            "endYear": "2001"
        },
        "achievements": [
            { "text": "The design, development, expansion, and maintenance of www.firstunion.com. Ensuring team members adhered to web site style guides while performing proper coding practices and training team members when needed." }
        ]
    }
]